================================================================================
kleenean literals
================================================================================

_true
_True
_false
_maybe
$

--------------------------------------------------------------------------------

(source_file
  (fragment
    (true))
  (fragment
    (true))
  (fragment
    (false))
  (fragment
    (maybe)))

================================================================================
unset literal
================================================================================

_unset
_UnseT
$

--------------------------------------------------------------------------------

(source_file
  (fragment
    (unset))
  (fragment
    (unset)))

================================================================================
number literal
================================================================================

0
65535
4294967295
18446744073709551617
0.0
655.35
-65535
-655.35
2e+2
2.2e10
$

--------------------------------------------------------------------------------

(source_file
  (fragment
    (number))
  (fragment
    (number))
  (fragment
    (number))
  (fragment
    (number))
  (fragment
    (number))
  (fragment
    (number))
  (fragment
    (unary_operator
      (number)))
  (fragment
    (unary_operator
      (number)))
  (fragment
    (number))
  (fragment
    (number)))

================================================================================
symbol
================================================================================

:symbol
:boolean?
:kleenean??
:int!internal
:|piped|
:int|!|internal
:new|()|
:|A|b|c ||()|
:_new
:|=|
:|new world|
:||
$

--------------------------------------------------------------------------------

(source_file
  (fragment
    (symbol))
  (fragment
    (symbol))
  (fragment
    (symbol))
  (fragment
    (symbol))
  (fragment
    (symbol))
  (fragment
    (symbol))
  (fragment
    (symbol))
  (fragment
    (symbol))
  (fragment
    (symbol))
  (fragment
    (symbol))
  (fragment
    (symbol))
  (fragment
    (symbol)))

================================================================================
vector
================================================================================

{}

{1,2,3}
$

--------------------------------------------------------------------------------

(source_file
  (fragment
    (vector))
  (fragment
    (vector
      (number)
      (number)
      (number))))

================================================================================
regular expression
================================================================================

/Hello\,\s\w+!/

/Hello\,\s\w+!/i

/[a-t]-[1-4]/

//

/a\/b/i

/abc\d{2,4}/i

/Foo(bAr)?/i

/[aB]*c,/im

--------------------------------------------------------------------------------

(source_file
  (fragment
    (regex_literal))
  (fragment
    (regex_literal))
  (fragment
    (regex_literal))
  (fragment
    (regex_literal))
  (fragment
    (regex_literal))
  (fragment
    (regex_literal))
  (fragment
    (regex_literal))
  (fragment
    (regex_literal)))
